app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @schoolClasses = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Potions"], ["room_number", 123], ["created_at", "2019-08-30 19:51:44.817538"], ["updated_at", "2019-08-30 19:51:44.817538"]]
---
  def create
    new_class = SchoolClass.create(school_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-09-03 01:46:00.446833"], ["id", 1]]
---
  def update #update based on what the form responses were
    school_class = SchoolClass.find(params[:id]) #find what this is associated with >> school_class = instance of SchoolClass with id, title, room_number
    school_class.update(school_params) #update school instance based on the form  >>  school_params = <ActionController::Parameters {"title"=>"Magical Potions", "room_number"=>"617"} permitted: true>

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
---
  def destroy
    school_class = SchoolClass.find(params[:id])
    school_class.destroy