app/controllers/school_classes_controller.rb

  def update
    school_class = SchoolClass.find(params[:id])
    school_class.update(school_class_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 617], ["updated_at", "2019-08-30 20:18:51.605813"], ["id", 1]]